app/controllers/cards_controller.rb

  def create
    hobo_create do
      if valid? then
        if true || @card.list && @card.list.owner_is?(current_user)
        else
          if params[:after_submit].present? then
            uri = params[:after_submit]
            uri.gsub!(/(?:\?|&)?edit_id=\d+/, "")
            if uri.include?("?") then
              uri << "&edit_id=#{@card.id}"
---
INSERT INTO "cards" ("kind", "name", "number", "created_at", "body", "updated_at", "whole_id", "list_id") VALUES(NULL, NULL, 40, '2009-06-29 01:16:42', NULL, '2009-06-29 01:16:42', 149, NULL)

  def load_editable_card
    return if params[:edit_id].blank?

    @editable_card     = Card.find_by_id(params[:edit_id])
    @editable_children = Array(@editable_card) + @editable_card.find_deep_aspects
---
SELECT * FROM "cards" WHERE (list_id IS NULL) ORDER BY number DESC LIMIT 1
SELECT * FROM "cards"